### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.base.module.server.aws_lightsail_instance_public_ports.web must be replaced
-/+ resource "aws_lightsail_instance_public_ports" "web" {
!       id            = "k2ss_instance-1421794143" -> (known after apply)
        # (1 unchanged attribute hidden)

-       port_info { # forces replacement
-           cidr_list_aliases = [
-               "lightsail-connect",
            ] -> null
-           cidrs             = [
-               "106.155.10.236/32",
            ] -> null
-           from_port         = 22 -> null
-           ipv6_cidrs        = [] -> null
-           protocol          = "tcp" -> null
-           to_port           = 22 -> null
        }
-       port_info { # forces replacement
-           cidr_list_aliases = [] -> null
-           cidrs             = [
-               "0.0.0.0/0",
            ] -> null
-           from_port         = 443 -> null
-           ipv6_cidrs        = [
-               "::/0",
            ] -> null
-           protocol          = "tcp" -> null
-           to_port           = 443 -> null
        }
-       port_info { # forces replacement
-           cidr_list_aliases = [] -> null
-           cidrs             = [
-               "0.0.0.0/0",
            ] -> null
-           from_port         = 80 -> null
-           ipv6_cidrs        = [
-               "::/0",
            ] -> null
-           protocol          = "tcp" -> null
-           to_port           = 80 -> null
        }
+       port_info { # forces replacement
+           cidr_list_aliases = (known after apply)
+           cidrs             = (known after apply)
+           from_port         = 443
+           ipv6_cidrs        = (known after apply)
+           protocol          = "tcp"
+           to_port           = 443
        }
+       port_info { # forces replacement
+           cidr_list_aliases = (known after apply)
+           cidrs             = (known after apply)
+           from_port         = 80
+           ipv6_cidrs        = (known after apply)
+           protocol          = "tcp"
+           to_port           = 80
        }
+       port_info { # forces replacement
+           cidr_list_aliases = [
+               "lightsail-connect",
            ]
+           cidrs             = [
+               "106.155.10.236/32",
            ]
+           from_port         = 22
+           ipv6_cidrs        = (known after apply)
+           protocol          = "tcp"
+           to_port           = 22
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>